================================================================================
Test cmd with hyphen
================================================================================
build-string
--------------------------------------------------------------------------------

(source_file
  (command
    (identifier)))

================================================================================
Test cmd with hyphen and arg
================================================================================
build-string $fahren
--------------------------------------------------------------------------------

(source_file
  (command
    (identifier)
    (value_path
      (identifier))))

================================================================================
Test cmd with args
================================================================================
build-string $fahren ' °F is ' $celcius ' °C'
--------------------------------------------------------------------------------

(source_file
  (command
    (identifier)
    (value_path
      (identifier))
    (string)
    (value_path
      (identifier))
    (string)))

================================================================================
Test cmd with flagargs
================================================================================
cmd -f --flag -flag
--------------------------------------------------------------------------------

(source_file
  (command
    (identifier)
    (flag_arg)
    (flag_arg)
    (flag_arg)))

================================================================================
Test native cmd with flags and args
================================================================================
^git --no-pager log --graph --all --oneline --decorate --simplify-by-decoration -n 10
--------------------------------------------------------------------------------

(source_file
  (command
    (identifier)
    (flag_arg)
    (identifier)
    (flag_arg)
    (flag_arg)
    (flag_arg)
    (flag_arg)
    (flag_arg)
    (flag_arg)
    (number_literal)))
