================================================================================
Test simple def
================================================================================
def a [] {}
--------------------------------------------------------------------------------

(source_file
  (function_definition
    (identifier)
    (signature)
    (block)))

================================================================================
Test simple exported def
================================================================================
export def a [] {}
--------------------------------------------------------------------------------

(source_file
  (function_definition
    (identifier)
    (signature)
    (block)))

================================================================================
Test def with full flag
================================================================================
def cmd [
    --command(-c): string # The command to run
    --interval(-i): duration # The interval duration
    ] { }
--------------------------------------------------------------------------------

(source_file
  (function_definition
    (identifier)
    (signature
      (flag
        (flag_name)
        (flag_shorthand_name)
        (type))
      (comment)
      (flag
        (flag_name)
        (flag_shorthand_name)
        (type))
      (comment))
    (block)))

================================================================================
Test def with default arg value
================================================================================
def cmd [
    interval: duration = 5000 # The interval duration
    interval2 = 5000 # The interval duration
    ] { }
--------------------------------------------------------------------------------

(source_file
  (function_definition
    (identifier)
    (signature
      (parameter
        (identifier)
        (type)
        (default_parameter_assignment
          (number_literal)))
      (comment)
      (parameter
        (identifier)
        (default_parameter_assignment
          (number_literal)))
      (comment))
    (block)))

================================================================================
Test def with default flag value
================================================================================
def cmd [
    --interval(-i): duration = 5000 # The interval duration
    --interval2(-i) = 5000 # The interval duration
    ] { }
--------------------------------------------------------------------------------

(source_file
  (function_definition
    (identifier)
    (signature
      (flag
        (flag_name)
        (flag_shorthand_name)
        (type)
        (default_parameter_assignment
          (number_literal)))
      (comment)
      (flag
        (flag_name)
        (flag_shorthand_name)
        (default_parameter_assignment
          (number_literal)))
      (comment))
    (block)))

================================================================================
Test def with default value from call
================================================================================
def cmd [
    arg@call
    arg2:string@call2
    --flag:string@call3
    ] { }
--------------------------------------------------------------------------------

(source_file
  (function_definition
    (identifier)
    (signature
      (parameter
        (identifier)
        (default_parameter_assignment
          (identifier)))
      (parameter
        (identifier)
        (type)
        (default_parameter_assignment
          (identifier)))
      (flag
        (flag_name)
        (type)
        (default_parameter_assignment
          (identifier))))
    (block)))
